api/app/controllers/todos_controller.rb

INSERT INTO "todos" ("title", "description", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "adding 1"], ["description", "adding 1's desc"], ["completed", 0], ["created_at", "2025-04-09 11:30:17.937656"], ["updated_at", "2025-04-09 11:30:17.937656"]]
---
  def create
    todo = Todo.new(todo_params)
    if todo.save